Repository: CofficLab/Lumi
Catalog: Plugins/AutoTaskPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: All tasks completed!
zh_hans: 所有任务已完成！
zh_hk: 所有任務已完成！

source: Appended %lld tasks:
zh_hans: 已追加 %lld 个任务：
zh_hk: 已追加 %lld 個任務：

source: Auto Task
zh_hans: 自动任务
zh_hk: 自動任務

source: Break down complex goals into trackable tasks and drive Agent auto-progress.
zh_hans: 将复杂目标分解为可追踪的任务，并驱动 Agent 自动推进。
zh_hk: 將複雜目標分解為可追蹤的任務，並驅動 Agent 自動推進。

source: Collapse
zh_hans: 收起
zh_hk: 收起

source: Completed
zh_hans: 已完成
zh_hk: 已完成

source: Continue working on this task now.
zh_hans: 请继续处理此任务。
zh_hk: 請繼續處理此任務。

source: Created %lld tasks:
zh_hans: 已创建 %lld 个任务：
zh_hk: 已建立 %lld 個任務：

source: Current focus: %@
zh_hans: 当前进行中：%@
zh_hk: 當前進行中：%@

source: Error: conversation_id is required
zh_hans: 错误：缺少 conversation_id
zh_hk: 錯誤：缺少 conversation_id

source: Error: failed to save task status: %@
zh_hans: 错误：保存任务状态失败：%@
zh_hk: 錯誤：儲存任務狀態失敗：%@

source: Error: failed to save tasks: %@
zh_hans: 错误：保存任务失败：%@
zh_hk: 錯誤：儲存任務失敗：%@

source: Error: no valid tasks found (each task needs a non-empty title)
zh_hans: 错误：没有有效的任务（每个任务需要非空的标题）
zh_hk: 錯誤：沒有有效的任務（每個任務需要非空的標題）

source: Error: status must be one of: in_progress, completed, skipped
zh_hans: 错误：status 必须是以下之一：in_progress、completed、skipped
zh_hk: 錯誤：status 必須是以下之一：in_progress、completed、skipped

source: Error: task not found (id: %@)
zh_hans: 错误：找不到任务 (id: %@)
zh_hk: 錯誤：找不到任務 (id: %@)

source: Error: task_id is required
zh_hans: 错误：缺少 task_id
zh_hk: 錯誤：缺少 task_id

source: Error: tasks array is required
zh_hans: 错误：缺少任务列表
zh_hk: 錯誤：缺少任務列表

source: Error: tasks array must not be empty
zh_hans: 错误：任务列表不能为空
zh_hk: 錯誤：任務列表不能為空

source: Expand
zh_hans: 展开
zh_hk: 展开

source: Failed to auto-start next task: %@
zh_hans: 自动开始下一个任务失败：%@
zh_hk: 自動開始下一個任務失敗：%@

source: In Progress
zh_hans: 进行中
zh_hk: 進行中

source: Next task auto-started: %1$@ (id: %2$@)
zh_hans: 下一个任务已自动开始：%1$@ (id: %2$@)
zh_hk: 下一個任務已自動開始：%1$@ (id: %2$@)

source: Next task: %1$@ — start by calling update_task with status 'in_progress'
zh_hans: 下一个任务：%1$@ — 请调用 update_task 并设置 status 为 'in_progress' 开始
zh_hk: 下一個任務：%1$@ — 請調用 update_task 並設置 status 為 'in_progress' 開始

source: Next up: %@
zh_hans: 接下来：%@
zh_hk: 接下來：%@

source: No tasks found for this conversation. Use create_task to plan your work.
zh_hans: 当前对话没有任务。请使用 create_task 来规划你的工作。
zh_hk: 當前對話沒有任務。請使用 create_task 來規劃你的工作。

source: Now start working on task #1: %@
zh_hans: 现在开始处理第 1 个任务：%@
zh_hk: 現在開始處理第 1 個任務：%@

source: Pending
zh_hans: 待处理
zh_hk: 待處理

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理

source: Skipped
zh_hans: 已跳过
zh_hk: 已跳過

source: Task List
zh_hans: 任务列表
zh_hk: 任務列表

source: Task Progress: %1$@/%2$@ (%3$@%%)
zh_hans: 任务进度：%1$@/%2$@ (%3$@%%)
zh_hk: 任務進度：%1$@/%2$@ (%3$@%%)

source: Task status updated to **%@**.
zh_hans: 任务状态已更新为 **%@**。
zh_hk: 任務狀態已更新為 **%@**。

source: Tasks
zh_hans: 任务
zh_hk: 任務

source: Tasks (%lld total)
zh_hans: 任务列表（共 %lld 个）
zh_hk: 任務列表（共 %lld 個）
